Repository: prabathsingh101/CQRSMediaTR
Catalog: CQRSMediaTR.API/Resources/SharedResource.*.resx
Languages: id

# ALPHANUMERICPATTERN
source: Value should be alphanumeric only
id: Nilai harus berupa alfanumerik saja

# ALPHANUMERIC_OR_SPECIAL_REQUIRED
source: Value should be alphanumeric and special characters only.
id: Nilai harus alfanumerik dan karakter khusus saja.

# BEDTYPE_REQUIRED
source: Bed Type is required.
id: Jenis Tempat Tidur diperlukan.

# BED_TYPE_CODE_REQUIRED
source: Bed Type Code is required.
id: Kode Tipe Tempat Tidur diperlukan.

# CITY_CODE_REQUIRED
source: CityCode is required.
id: Kode Kota diperlukan.

# CLINICCODE_REQUIRED
source: Clinic code is required.
id: Kode klinik diperlukan.

# CLINIC_NAME_REQUIRED
source: Clinic name is required.
id: Nama klinik wajib diisi.

# CODE_REQUIRED
source: Code is required.
id: Kode diperlukan.

# CONTRACT_FROM_REQUIRED
source: Contract From is required.
id: Kontrak Dari diperlukan.

# CONTRACT_TO_REQUIRED
source: Contract To is required.
id: Kontrak Untuk diperlukan

# COST_RANG
source: Estimated Cost From maximum length should be 13
id: Perkiraan Biaya Dari panjang maksimum harus 13

# COST_RANG_0_100
source: Extension maximum length should be 8
id: Panjang maksimum ekstensi harus 8

# COUNTRY_CODE_REQUIRED
source: Country is required.
id: Negara diperlukan.

# DEPARTMENT_REQUIRED
source: Department is required.
id: Departemen diperlukan.

# DEPOSIT_REQUIRED
source: Deposit Collected is required.
id: Deposit Dikumpulkan diperlukan.

# DESCRIPTION_REQUIRED
source: Description is required.
id: Deskripsi diperlukan.

# DISPLAY_REQUIRED
source: Display is required.
id: Layar diperlukan.

# DOCTOR_NAME_REQUIRED
source: Doctor Name is required.
id: Nama Dokter diperlukan.

# EMAIL_VALIDATION
source: Email should be valid
id: Email harus valid

# ESTIMATE_COST_REQUIRED
source: Estimated Cost From is required.
id: Perkiraan Biaya Dari diperlukan.

# ESTIMATE_COST_TO_REQUIRED
source: Estimated Cost To is required.
id: Estimasi Biaya Untuk diperlukan.

# EXTENSION_NO_REQUIRED
source: Extension Number is required.
id: Perlu Nomor Ekstensi.

# FAXPATTERN
source: Enter a valid fax number
id: Masukkan Nomor Faks yang Valid

# HOLIDAYDATE_REQUIRED
source: HolidayDate is required.
id: Tanggal Liburan diperlukan.

# HOLIDAYNAME_REQUIRED
source: HolidayName is required.
id: HolidayName diperlukan.

# HOLIDAYTYPECODE_REQUIRED
source: HolidayTypeCode is required
id: HolidayTypeCode diperlukan

# ICSTATUS_REQUIRED
source: Icstatus is required.
id: Status diperlukan.

# IDENTIFICATIONTYPEFIELD_REQUIRED
source: IdentificationTypeField is required.
id: Bidang Jenis Identifikasi wajib diisi.

# IDENTIFICATIONTYPE_REQUIRED
source: IdentificationTypeFormat is required.
id: IdentificationTypeFormat diperlukan.

# INTEGER_OR_DECIMAL_REQUIRED
source: Value should be integer or decimal upto two place
id: Nilai harus bilangan bulat atau desimal hingga dua tempat

# JOINT_AT_REQUIRED
source: Joint At is required
id: Bersama Di diperlukan.

# MAX100_LENGTH
source: Maximum 100 characters.
id: Maksimal 100 karakter.

# MAX200_LENGTH
source: Maximum 200 characters.
id: Maksimum 200 karakter.

# MAX20_LENGTH
source: Maximum 20 characters.
id: Maksimum 20 karakter.

# MAX25_LENGTH
source: maximum length should be 25
id: panjang maksimum harus 25

# MAX300_LENGTH
source: Maximum 300 characters.
id: Maksimum 300 karakter.

# MAX32_LENGTH
source: maximum length should be 32
id: panjang maksimum harus 32

# MAX50_LENGTH
source: Maximum 50 characters.
id: Maksimum 50 karakter.

# MAX600_LENGTH
source: Maximum 600 characters.
id: Maksimum 600 karakter.

# MAX_BED_LENGTH
source: Maximum Bed maximum length should be 4
id: Maksimum Tempat tidur panjang maksimum harus 4

# MAX_BED_REQUIRED
source: Maximum Bed is required.
id: Tempat Tidur Maksimum diperlukan.

# NUMBERONLY
source: Extension should be numeric
id: Ekstensi harus numerik

# NUMBERONLY_MAXBED
source: Maximum Bed should be numeric
id: Ranjang Maksimum harus numerik

# PARENT_COMPANY_REQUIRED
source: Parent Company Name is required.
id: Nama Perusahaan Induk wajib diisi.

# PHONENUMBER1_REQUIRED
source: PhoneNumber1 is required.
id: PhoneNumber1 diperlukan.

# PHONENUMBERCODE1_REQUIRED
source: PhoneNumber1Code is required.
id: PhoneNumber1Code diperlukan.

# POST_CODE_REQUIRED
source: PostCode is required.
id: Kodepos diperlukan.

# PRIVILEGE_CODE_REQUIRED
source: Privilege Code is required.
id: Kode Hak Istimewa diperlukan.

# ROOM_CODE_REQUIRED
source: Room Code is required.
id: Kode Kamar diperlukan.

# ROOM_DESCRIPTION_REQUIRED
source: Room Description is required.
id: Deskripsi Kamar diperlukan.

# ROOM_REQUIRED
source: Room is required.
id: Kamar diperlukan.

# STARTDATE_REQUIRED
source: StartDate is required.
id: TanggalMulai diperlukan.

# STATE_CODE_REQUIRED
source: StateCode is required.
id: Kode Negara diperlukan.

# STATUS_ALREADY_ACTIVATED
source: Device Already Activated
id: Perangkat Sudah Diaktifkan

# STATUS_ALREADY_REGISTERED
source: Device Already Registered
id: Perangkat Sudah Terdaftar

# STATUS_BUSINESSREGNO_REQUIRED
source: Business Reg No. is required
id: Nomor Pendaftaran Bisnis diperlukan.

# STATUS_CITY_CODE_DOESNT_EXIST
source: City Code doesn't exist
id: Kode Kota tidak ada

# STATUS_CODE_DESCRIPTION_EXIST
source: Code and Description already exist.
id: Kode dan Deskripsi sudah ada.

# STATUS_CODE_EXIST
source: Code already exist
id: Kode sudah ada

# STATUS_CODE_EXISTS
source: Code already exist
id: Kode sudah ada

# STATUS_CODE_NOT_EXIST
source: Code doesn't exist
id: Kode tidak ada

# STATUS_COMPANYNAMEVN_REQUIRED
source: Company Name(VN) is required
id: Nama Perusahaan (VN) diperlukan

# STATUS_COMPANY_NAME_EXISTS
source: Company Name already exist
id: Nama Perusahaan sudah ada

# STATUS_COUNTRY_CODE_DOESNT_EXIST
source: Country Code doesn't exist
id: Deskripsi sudah ada

# STATUS_DATA_ADDED
source: Record Added Successfully
id: Rekaman Berhasil Ditambahkan

# STATUS_DATA_ADD_FAIL
source: Record Not Added
id: Rekam Tidak Ditambahkan

# STATUS_DATA_CLEARED
source: Data Cleared Successfully.
id: DATA STATUS DIHAPUS.

# STATUS_DATA_SEEDED
source: Data Seeded Successfully.
id: DATA STATUS DIBENIKAN.

# STATUS_DATA_DELETED
source: Record Deleted Successfully
id: Rekaman Berhasil Dihapus

# STATUS_DATA_DELETE_FAIL
source: Record Not Deleted
id: Rekam Tidak Dihapus

# STATUS_DATA_FAIL
source: Record Not Found
id: Rekaman tidak ditemukan

# STATUS_DATA_FOUND
source: Record Found
id: Rekaman Ditemukan

# STATUS_DATA_UPDATED
source: Record Updated Successfully
id: Rekaman Berhasil Diperbarui

# STATUS_DATA_UPDATE_FAIL
source: Record Not Updated
id: Rekam Tidak Diperbarui

# STATUS_DEBTOR_CATEGORY_CODE_DOESNT_EXIST
source: Debtor Category Code doesn't exist,
id: Kode Kategori Debitur tidak ada,

# STATUS_DEPARTMENTOFHEALTHVN_REQUIRED
source: Department Of Health(VN) is required
id: Departemen Kesehatan (VN) diperlukan

# STATUS_DEPARTMENTOFHEALTH_REQUIRED
source: Department Of Health is required
id: Departemen Kesehatan diperlukan

# STATUS_DESCRIPTIONVN_REQUIRED
source: DescriptionVN is required
id: DeskripsiVN diperlukan

# STATUS_DESCRIPTION_EXIST
source: Description already exist
id: Deskripsi sudah ada

# STATUS_FAILED
source: Failed
id: Gagal

# STATUS_HOSPITALS_NOT_FOUND
source: No Hospital Found
id: Rumah Sakit Tidak Ditemukan

# STATUS_INPROGRESS
source: In Progress
id: Sedang berlangsung

# STATUS_INVALID_REGIONCODE
source: Invalid Region Code
id: Kode Wilayah Tidak Valid

# STATUS_INVALID_REQUEST
source: Invalid Request Parameter
id: Parameter Permintaan Tidak Valid

# STATUS_INVALID_ROOM_ID
source: Invalid Room Id
id: Id Kamar Tidak Valid

# STATUS_INVALID_SESSION
source: Invalid Session
id: Sesi Tidak Valid

# STATUS_INVALID_SESSION_ID
source: Your App Session Expired. Please Exit App And Login Once Again.
id: Sesi Aplikasi Anda Berakhir. Silakan Keluar dari Aplikasi Dan Masuk Sekali Lagi.

# STATUS_INVALID_TOKEN
source: Invalid Token
id: Token Tidak Valid

# STATUS_INVALIED_TOKEN
source: Invalid Token
id: Token Tidak Valid

# STATUS_ISDELETED_TRUE
source: Record not saved as IsDeleted is true
id: Rekam tidak disimpan karena IsDeleted benar

# STATUS_ISOBSOLETE_TRUE
source: Record not saved as IsObsolete is true
id: Rekam tidak disimpan karena IsObsolete benar

# STATUS_MESSAGE_SENDING_ERROR
source: Message Sending Error
id: Kesalahan Pengiriman Pesan

# STATUS_NODEVICE_FOUND
source: No Device Found
id: Tidak Ada Perangkat Ditemukan

# STATUS_PostCode_Required
source: Post Code is required
id: Kode Pos diperlukan

# STATUS_PROVIDE_VALID_TOKEN
source: Please provide valid token
id: Berikan token yang valid

# STATUS_REDISCACHE_UPDATED
source: Redis Cache Updated Successfully
id: Redis Cache Berhasil Diperbarui

# STATUS_REFERENCE_DATA
source: Error:
id: Kesalahan:

# STATUS_REGIONCODE_REQUIRED
source: Region code is required
id: Kode wilayah diperlukan

# STATUS_REGISTRATION_FAILED
source: Registration Failed
id: Registrasi gagal

# STATUS_SERVER_ERROR
source: Internal Server Error, Please Try Later.
id: Kesalahan Server Internal, Silakan Coba Nanti.

# STATUS_SMRPCODE_EXIST
source: SMRP Code already exist
id: Kode SMRP sudah ada

# STATUS_SMRPCODE_REQUIRED
source: SMRP Code is required
id: Kode SMRP diperlukan

# STATUS_SMRPDESCRIPTION_REQUIRED
source: SMRP Description is required
id: Deskripsi SMRP diperlukan

# STATUS_SMRPFACILITYCODE_REQUIRED
source: SMRP Facility Code is required
id: Kode Fasilitas SMRP diperlukan

# STATUS_STATE_CODE_DOESNT_EXIST
source: State Code doesn't exist
id: Kode Negara tidak ada

# STATUS_SUCCESS
source: Success
id: Kesuksesan

# STATUS_UNAUTHORIZED_ACCESS
source: Unauthorized Access
id: Akses tidak sah

# STATUS_UNAUTHORIZED_USER
source: User doesn't have access or permission
id: Pengguna tidak memiliki akses atau izin

# STATUS_XSS_DETECTED
source: XSS detected!
id: XSS dikesan!

# STREET1_REQUIRED
source: Street4 is required.
id: Jalan1 diperlukan.

# VALIDEXPIRYDATE_REQUIRED
source: ValidateExpiryDate is required.
id: ValidateExpiryDate diperlukan.

# WARDID_REQUIRED
source: Ward is required.
id: Ward diperlukan.

# WARD_CODE_REQUIRED
source: Ward Code is required.
id: Kode Lingkungan diperlukan.

# WARD_DESCRIPTION_REQUIRED
source: Ward Description is required.
id: Deskripsi Lingkungan diperlukan.
